googlecontacts/src/test/resources/artifacts/ESB/config/requests/googlecontacts/esb_batchCreateContactGroups_negative.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="wso2.connector.googlecontacts">
   <soapenv:Header/>
   <soapenv:Body>
	<urn:batchcreatecontacts>	
      <urn:appName>%s(appName)</urn:appName>
      <urn:userEmail>%s(userEmail)</urn:userEmail>      
      <urn:accessToken>%s(accessToken)</urn:accessToken>
	  <urn:batchGroups>
		<entry>
			<id>retrieve</id>
			<type>query</type>
			<groupId>1111111</groupId>
		</entry>
	  </urn:batchGroups>     
	  <urn:method>batchCreateContactGroups</urn:method>
	 </urn:batchcreatecontacts>	 
   </soapenv:Body>
</soapenv:Envelope>